---
kind: method
id: M:Autodesk.Revit.DB.IntegerParameterValue.#ctor(System.Int32)
source: html/d8a59b83-ab83-c968-49ee-6d008f598e85.htm
---
# Autodesk.Revit.DB.IntegerParameterValue.#ctor Method

Value constructor

## Syntax (C#)
```csharp
public IntegerParameterValue(
	int value
)
```

## Parameters
- **value** (`System.Int32`)